using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace GuessGame
{/*■ После входа в систему пользователь может:
 * • стартовать новую викторину;
 * • посмотреть результаты своих прошлых викторин;
 * • посмотреть Топ-20 по конкретной викторине;
 * • изменить настройки: можно менять пароль и дату рождения;
 * • выход.
 * 
 * ■ Для старта новой викторины пользователь должен выбрать раздел знаний викторины. Например: «История», «География», «Биология» и т.д. Также нужно nпредусмотреть смешанную викторину, когда вопросы будут выбираться из разных викторин по случайному принципу.
 * 
 * ■ Конкретная викторина состоит из двадцати вопросов. У каждого вопроса может быть один или несколько правильных вариантов ответа. Если вопрос предполагает несколько правильных ответов, а пользователь указал не все, вопрос не засчитывается.
 * ■ По завершении викторины пользователь получает количество правильно отвеченных вопросов, а также свое место в таблице результатов игроков викторины.
 * Необходимо также разработать утилиту для создания и редактирования викторин и их вопросов. Это приложение должно предусматривать вход по логину и паролю.*/
    public class Class1
    {
    }
}
