namespace GuessGame
{
    internal class Program
    {/*■ После входа в систему пользователь может:
 * • стартовать новую викторину;
 * • посмотреть результаты своих прошлых викторин;\r\n• посмотреть Топ-20 по конкретной викторине;\r\n• изменить настройки: можно менять пароль и дату рождения;\r\n• выход.\r\n■ Для старта новой викторины пользователь должен выбрать раздел знаний викторины. Например: «История», «География», «Биология» и т.д. Также нужно\r\nпредусмотреть смешанную викторину, когда вопросы будут выбираться из разных\r\nвикторин по случайному принципу.\r\n■ Конкретная викторина состоит из двадцати вопросов. У каждого вопроса может\r\nбыть один или несколько правильных вариантов ответа. Если вопрос предполагает\r\nнесколько правильных ответов, а пользователь указал не все, вопрос не засчитывается.\r\n■ По завершении викторины пользователь получает количество правильно отвеченных вопросов, а также свое место в таблице результатов игроков викторины.\r\nНеобходимо также разработать утилиту для создания и редактирования викторин\r\nи их вопросов. Это приложение должно предусматривать вход по логину и паролю.*/
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}
